# -*- mode: org -*-
# Time-stamp: <2011-12-18 11:06:25 Sunday by richard>
#+STARTUP: showall
#+TITLE:   LoopsAndRecursion

* When concatenates two list when append a list to another will make the first one as a list.
#+begin_src emacs-lisp :tangle yes
(cons '(1 2 3) 3)
#+end_src

#+results:

#+begin_src emacs-lisp :tangle yes
(cons 3 '(1 2 3))
#+end_src

#+results:
| 3 | 1 | 2 | 3 |


** Write a function similar to triangle that multiplies instead of adds the values.
#+begin_src emacs-lisp :tangle yes
(defun multi-triangle(num)
  "Docstring of multi-triangle"
  (let ((total 1))
    (dotimes (number num total)
      (setq total (* (1+ number) total)))))
(multi-triangle 5)
#+end_src

#+results:
: 6

